app/views/customers/index.html.erb

SELECT  `customers`.* FROM `customers`  ORDER BY `customers`.`id` ASC LIMIT 1000
---
  </tr>
<% Customer.find_each do |customer| %>