app/controllers/books_controller.rb

def create
 @book = Book.new(book_params)
  if @book.save
---
INSERT INTO `books` (`title`, `author`, `publisher`, `genre`) VALUES ('Black Forest', 'Black Forest', 'Pfandflasche', 'Still')