app/controllers/borrowings_controller.rb

  def index
    if params['customer_id']
	@borrowings = Borrowing.where(customer_id: params['customer_id']).all
    else
	@borrowings = Borrowing.all
---
SELECT  `borrowings`.* FROM `borrowings` WHERE `borrowings`.`customer_id` IS NULL  ORDER BY `borrowings`.`id` ASC LIMIT 1
SELECT `borrowings`.* FROM `borrowings`