app/controllers/copies_controller.rb

SELECT `copies`.* FROM `copies` WHERE `copies`.`book_id` = 6
SELECT `copies`.* FROM `copies`
---
  def index
    if params['book_id']
	@copies = Copy.where(book_id: params['book_id']).all
    else
	@copies = Copy.all